2023-2-grupo-37/app/models/message.rb

SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."room_id" = $2 ORDER BY "participants"."id" ASC LIMIT $3  [["user_id", 12], ["room_id", 28], ["LIMIT", 1]]
---
  def confirm_participant
    return unless self.room.is_private
    is_participant = Participant.where(user_id: self.user.id, room_id: self.room.id).first