2023-2-grupo-37/app/models/producto.rb

  def agregar_visita
    self.visitas += 1
    self.save
---
UPDATE "productos" SET "updated_at" = $1, "visitas" = $2 WHERE "productos"."id" = $3  [["updated_at", "2023-11-20 19:49:18.244994"], ["visitas", 1], ["id", 31]]