2023-2-grupo-37/app/models/reporte.rb

SELECT COUNT(*) FROM "reportes" WHERE "reportes"."producto_id" = $1  [["producto_id", 35]]
---
  def verificar_reportes
    if producto.reportes.count >= 3