2023-2-grupo-37/app/models/room.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_10_14"], ["is_private", true], ["created_at", "2023-10-28 08:51:14.644699"], ["updated_at", "2023-10-28 08:51:14.644699"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 14], ["room_id", 27], ["created_at", "2023-10-28 08:51:14.658720"], ["updated_at", "2023-10-28 08:51:14.658720"]]
---
  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
      users.each do |user|
        Participant.create(user_id: user.id, room_id: single_room.id)