2023-2-grupo-37/app/views/productos/index.html.erb

                <section class="productos">
                <% if Producto.count <= 0  or @productos.all? { |producto| producto.disponible == false }%>
---
SELECT "productos".* FROM "productos"
SELECT COUNT(*) FROM "productos"