2023-2-grupo-37/app/views/intercambios/index.html.erb

      <section class="intercambios">
        <% if Intercambio.count <= 0 or @intercambios.all? { |intercambio| ![intercambio.id_cliente, intercambio.id_propietario].include?(current_user.id) } %>
---
SELECT "intercambios".* FROM "intercambios"
SELECT COUNT(*) FROM "intercambios"

                <div class="atributo_dueno">Dueño </div>
                <div class="dueno_inter"> <%= User.find(intercambio.id_propietario).name %> </div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

                <div class="atributo_cliente">Cliente </div>
                <div class="cliente_inter"> <%= User.find(intercambio.id_cliente).name %> </div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

                <div class="atributos">Producto</div>
                <div class="producto_inter"> <%= Producto.find(intercambio.producto_id).nombre %> </div>
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]