CinemaApi/app/controllers/director_controller.rb

    def create
        @director = Director.new(director_params)
        if @director.save
---
INSERT INTO "directors" ("name", "age", "country", "has_oscars", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Quentin Tarantino"], ["age", 60], ["country", "United States"], ["has_oscars", 1], ["created_at", "2023-08-23 23:37:25.755083"], ["updated_at", "2023-08-23 23:37:25.755083"]]

    def index
        @director = Director.all
---
SELECT "directors".* FROM "directors"

    def show
        @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        @director = Director.find(params[:id])
        @director.destroy
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 8]]

    def destroy_todos
        Director.destroy_all
        render json: Director.all
---
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 18]]
SELECT "directors".* FROM "directors"

    def show_oscars
        @directores_filtrados = Director.where(has_oscars: true)
---
SELECT "directors".* FROM "directors" WHERE "directors"."has_oscars" = ?  [["has_oscars", 1]]