CinemaApi/app/controllers/movies_controller.rb

    def create
        @director = Director.find(params[:director_id])
        @movie = @director.movies.build(movies_params)

        if @movie.save
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "sinopsis", "duration", "premiere", "director_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def movies_por_director
        director = Director.find(params[:director_id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]

    def update
        @director = Director.find(params[:director_id])
        @movie = @director.movies.find(params[:movie_id])

        if @movie.update(movies_params)
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ? AND "movies"."id" = ? LIMIT ?  [["director_id", 39], ["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Tiempos Violentos"], ["updated_at", "2023-08-25 16:00:32.566008"], ["id", 2]]

    def buscar_por_keyword
        @movies = Movie.all
        movies_keyword = @movies.select { |movie| movie.sinopsis.include?(params[:keyword])}
---
SELECT "movies".* FROM "movies" WHERE (sinopsis ILIKE '%Robert%')
SELECT "movies".* FROM "movies"