CinemaApi/app/controllers/rankings_controller.rb

    def create
        @director = Director.find(params[:director_id])
        @ranking_creado = @director.rankings.build(rankings_params)

        if @ranking_creado.save
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]
INSERT INTO "rankings" ("page", "min_score", "score", "max_score", "director_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["page", "imdb"], ["min_score", 0.0], ["score", 8.7], ["max_score", 10.0], ["director_id", 71], ["created_at", "2023-08-26 16:18:39.913610"], ["updated_at", "2023-08-26 16:18:39.913610"]]

    def rankings_por_director
        director = Director.find(params[:director_id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]

    def mejores_rankings
        cantidad = params[:quantity].to_i

        @rankings_filtrados = Ranking.all.map do |ranking|
---
SELECT "rankings".* FROM "rankings"

    def encontrar_rankings
        @movie = Movie.find(params[:movie_id])
        @id_director = @movie.director
        @rankings = Ranking.where(director: @id_director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]
SELECT "rankings".* FROM "rankings" WHERE "rankings"."director_id" = ?  [["director_id", 83]]

    def eliminar_peor_director
        @rankings_filtrados = Ranking.all.map do |ranking|
            {
              ranking: ranking,
              key: (ranking.score - ranking.min_score) / (ranking.max_score - ranking.min_score)
            }
        end

        @rankings_ordenados = @rankings_filtrados.sort_by { |item| item[:key] }
        @peor_ranking = @rankings_ordenados[0]
        @peor_director = @peor_ranking[:ranking].director
        @peor_director.destroy
---
SELECT "rankings".* FROM "rankings"
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 112]]
DELETE FROM "rankings" WHERE "rankings"."id" = ?  [["id", 106]]

    def paginas_rankings
        # imdb
        @rankings_imdb = Ranking.where(page: "imdb")
        @imdb_con_llaves = @rankings_imdb.all.map do |ranking|
            {
              ranking: ranking,
              key: (ranking.score - ranking.min_score) / (ranking.max_score - ranking.min_score)
            }
        end
        @imdb_ordenados = @imdb_con_llaves.sort_by { |item| item[:key] }.reverse

        @imdb = @imdb_ordenados.map { |item| item[:ranking] }

        # metacritic
        @rankings_meta = Ranking.where(page: "metacritic")
        @meta_con_llaves = @rankings_meta.all.map do |ranking|
            {
              ranking: ranking,
              key: (ranking.score - ranking.min_score) / (ranking.max_score - ranking.min_score)
            }
        end
        @meta_ordenados = @meta_con_llaves.sort_by { |item| item[:key] }.reverse

        @metacritic = @meta_ordenados.map { |item| item[:ranking] }

        # rotten_tomatoes
        @rankings_rottentomatoes = Ranking.where(page: "rotten_tomatoes")
        @rottentomatoes_con_llaves = @rankings_rottentomatoes.all.map do |ranking|
---
SELECT "rankings".* FROM "rankings" WHERE "rankings"."page" = ?  [["page", "imdb"]]
SELECT "rankings".* FROM "rankings" WHERE "rankings"."page" = ?  [["page", "metacritic"]]
SELECT "rankings".* FROM "rankings" WHERE "rankings"."page" = ?  [["page", "rotten tomatoes"]]