2023-2-grupo-37/app/views/admins/intercambios.html.erb

SELECT "intercambios".* FROM "intercambios"
SELECT COUNT(*) FROM "intercambios"
---
        <section class="element-admin">
            <% if Intercambio.count > 0 %>

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
                    <div class="elements-admin">
                        <h2> Producto: <%= Producto.find(intercambio.producto_id).nombre %></h2>