2023-2-grupo-37/app/views/admins/reportes.html.erb

                    <div class="elements-admin">
                        <h2> Producto reportado: <%= Producto.find(reporte.producto_id).nombre %></h2>
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]