2023-2-grupo-37/app/controllers/admins_controller.rb

SELECT "productos".* FROM "productos"
---
  def productos
    @productos = Producto.all

SELECT "reportes".* FROM "reportes"
---
  def reportes
    @reportes = Reporte.all

SELECT "intercambios".* FROM "intercambios"
---
  def intercambios
    @intercambios = Intercambio.all

SELECT "users".* FROM "users"
---
  def usuarios
    @users = User.all