2023-2-grupo-37/app/controllers/intercambios_controller.rb

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "productos" SET "disponible" = $1, "updated_at" = $2 WHERE "productos"."id" = $3  [["disponible", false], ["updated_at", "2023-11-21 16:03:01.487837"], ["id", 35]]
INSERT INTO "intercambios" ("producto_id", "created_at", "updated_at", "estado", "id_propietario", "id_cliente") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["producto_id", 35], ["created_at", "2023-11-21 16:03:01.485016"], ["updated_at", "2023-11-21 16:03:01.485016"], ["estado", "Pendiente"], ["id_propietario", 10], ["id_cliente", 12]]
---
  def create
    @producto = Producto.find(params[:id])
    @intercambio = Intercambio.new(id_propietario: @producto.user.id, id_cliente: current_user.id,
                                   estado: 'Pendiente')

    @producto.update(disponible: false, intercambio: @intercambio)

    if @intercambio.save

SELECT "intercambios".* FROM "intercambios"
---
  def index
    @intercambios = Intercambio.all

SELECT "intercambios".* FROM "intercambios" WHERE "intercambios"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
UPDATE "productos" SET "disponible" = $1, "updated_at" = $2 WHERE "productos"."id" = $3  [["disponible", true], ["updated_at", "2023-11-21 16:03:36.693649"], ["id", 35]]
DELETE FROM "intercambios" WHERE "intercambios"."id" = $1  [["id", 39]]
---
  def destroy
    @intercambio = Intercambio.find(params[:id])
    @producto = @intercambio.producto
    @producto.update(disponible: true)
    @intercambio.destroy