2023-2-grupo-37/app/controllers/intercambios_controller.rb

SELECT "intercambios".* FROM "intercambios" WHERE "intercambios"."id" = $1 LIMIT $2  [["id", 488535345], ["LIMIT", 1]]
---
  def page_update
    @intercambio = Intercambio.find(params[:id])

SELECT "intercambios".* FROM "intercambios" WHERE "intercambios"."id" = $1 LIMIT $2  [["id", 488535345], ["LIMIT", 1]]
UPDATE "intercambios" SET "updated_at" = $1, "estado" = $2 WHERE "intercambios"."id" = $3  [["updated_at", "2023-11-22 00:31:34.184120"], ["estado", "Aceptado"], ["id", 488535345]]
---
  def update
    @intercambio = Intercambio.find(params[:id])
    if @intercambio.update(intercambio_params)