2023-2-grupo-37/app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 12], ["room_id", 28], ["body", ""], ["created_at", "2023-10-28 10:23:52.376337"], ["updated_at", "2023-10-28 10:23:52.376337"]]
---
  def create
    @current_user = current_user
    @message = @current_user.messages.create(body: msg_params[:body], room_id: params[:room_id])