2023-2-grupo-37/app/controllers/pins_controller.rb

  def index
    @pins = Pin.all
---
SELECT "pins".* FROM "pins"

  def create
    @pin = Pin.new(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "MyString"], ["created_at", "2023-10-28 05:39:00.938395"], ["updated_at", "2023-10-28 05:39:00.938395"]]

  def destroy
    @pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 980190962]]

  def set_pin
    @pin = Pin.find(params[:id])
---
SELECT "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]