2023-2-grupo-37/app/controllers/productos_controller.rb

  def page_update
    @producto = Producto.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 764813928], ["LIMIT", 1]]

  def update
    @user = User.find(current_user.id)
    @producto = Producto.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 590306657], ["LIMIT", 1]]
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 871544775], ["LIMIT", 1]]

  def create
    @user = User.find(current_user.id)
    @producto = @user.productos.new(producto_params)
    @producto.update(user: @user, disponible: true)
    if @producto.save
---
INSERT INTO "productos" ("nombre", "categoria", "disponible", "created_at", "updated_at", "estado", "intercambiado", "user_id", "descripcion") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"