2023-2-grupo-37/app/controllers/productos_controller.rb

  def index
    # @users = User.all
    @productos = Producto.all
---
SELECT "productos".* FROM "productos"

  def show
    @producto = Producto.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def favoritos
    @user = User.find(current_user.id)
    new_fav = @user.productos_fav
    if !new_fav.values.include?(Producto.find(params[:id]))
      new_fav[params[:id]] = Producto.find([params[:id]])
    end

    @user.update(productos_fav: new_fav)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "productos_fav" = $2 WHERE "users"."id" = $3

  def eliminar_favorito
    @user = User.find(current_user.id)
    new_fav = @user.productos_fav
    new_fav.delete(params[:id])
    @user.update(productos_fav: new_fav)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "productos_fav" = $2 WHERE "users"."id" = $3

  def mas_visitados
    @productos = Producto.order(visitas: :desc).limit(15)
---
SELECT "productos".* FROM "productos" ORDER BY "productos"."visitas" DESC LIMIT $1  [["LIMIT", 15]]

  def update
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def create
    @user = User.find(current_user.id)
    @producto = @user.productos.new(producto_params)
    @producto.update(user: @user, disponible: true)
    if @producto.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "productos" SET "updated_at" = $1 WHERE "productos"."id" = $2  [["updated_at", "2023-11-24 12:18:20.916563"], ["id", 39]]
INSERT INTO "productos" ("nombre", "categoria", "disponible", "user_id", "created_at", "updated_at", "estado", "intercambiado", "descripcion", "visitas") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @user = User.find(current_user.id)
    @producto = Producto.find(params[:id])

    new_fav = @user.productos_fav
    new_fav.delete(params[:id])
    @user.update(productos_fav: new_fav)

    @producto.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 28]]
DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 39]]