2023-2-grupo-37/app/controllers/reportes_controller.rb

SELECT "reportes".* FROM "reportes" WHERE "reportes"."producto_id" = $1  [["producto_id", 871544775]]
DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 871544775]]
DELETE FROM "reportes" WHERE "reportes"."id" = $1  [["id", 808710283]]
---
    def create
      @producto = Producto.find(params[:id])

      if @producto.reportes.count >= 3
        @producto.destroy

SELECT "reportes".* FROM "reportes" WHERE "reportes"."id" = $1 LIMIT $2  [["id", 808710283], ["LIMIT", 1]]
---
    def page_update
      @reporte = Reporte.find(params[:id])