2023-2-grupo-37/app/controllers/reportes_controller.rb

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def show
      @producto = Producto.find(params[:id])

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reportes" WHERE "reportes"."producto_id" = $1  [["producto_id", 35]]
INSERT INTO "reportes" ("producto_id", "user_id", "created_at", "updated_at", "nuevo_atributo", "descripcion") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @producto = Producto.find(params[:id])

      if @producto.reportes.count >= 3
        @producto.destroy
        redirect_to productos_path,
                    notice: 'El producto ha sido eliminado debido a que ha superado el número máximo de reportes.'
      else
        @reporte = Reporte.new(reporte_params)
        @reporte.producto = @producto
        @reporte.user = current_user

        if @reporte.save

SELECT "reportes".* FROM "reportes" WHERE "reportes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "reportes" WHERE "reportes"."id" = $1  [["id", 15]]
---
    def destroy
      @reporte = Reporte.find(params[:id])
      @reporte.destroy