2023-2-grupo-37/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @users = User.all_except(current_user)

    @room = Room.new
    @rooms = Room.public_rooms
    @room_name = get_name(@user, current_user)
    @single_room = Room.where(name: @room_name).first || Room.create_private_room([@user, current_user], @room_name)

    @message = Message.new
    @messages = @single_room.messages.order(created_at: :asc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_10_14"], ["is_private", true], ["created_at", "2023-10-28 08:51:14.644699"], ["updated_at", "2023-10-28 08:51:14.644699"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 ORDER BY "rooms"."id" ASC LIMIT $2  [["name", "private_10_14"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" ASC  [["room_id", 27]]

  def cuenta_visita
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def calificar_usuario
    @user = User.find(params[:id])

    if @user.calificacion == 0
      promedio_estrellas = params[:calificacion].to_i
    else
      promedio_estrellas = (@user.calificacion + params[:calificacion].to_i) / 2
    end

    @user.update(calificacion: promedio_estrellas)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "calificacion" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-12-06 15:49:18.896779"], ["calificacion", 1], ["id", 12]]

  def page_update
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def favoritos
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]