2023-2-grupo-37/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "name" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-10-28 08:37:00.294443"], ["name", "Nuevo Nombre"], ["id", 590306657]]