2023-2-grupo-37/app/views/users/favoritos.html.erb

            <% @user.productos_fav.each do |fav| %>
              <% if Producto.find(fav[0]).disponible == true %>
                <% producto = Producto.find(fav[0]) %>
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]